app/controllers/dear_mes_controller.rb

SELECT "dear_mes".* FROM "dear_mes"
---
  def index
    @dear_mes = DearMe.all

INSERT INTO "dear_mes" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "azeaze"], ["created_at", "2021-05-05 19:54:09.030914"], ["updated_at", "2021-05-05 19:54:09.030914"]]
---
  def create
    @dear_me = DearMe.new(dear_me_params)
    @dear_me.user = current_user
    respond_to do |format|
      if @dear_me.save

UPDATE "dear_mes" SET "name" = $1, "updated_at" = $2 WHERE "dear_mes"."id" = $3  [["name", "Bonjour, ceci est une idée ! Hahaha"], ["updated_at", "2021-05-06 12:34:20.995585"], ["id", 9]]
---
  def update
    respond_to do |format|
      if @dear_me.update(dear_me_params)

DELETE FROM "dear_mes" WHERE "dear_mes"."id" = $1  [["id", 1]]
---
  def destroy
    @dear_me.destroy

SELECT "dear_mes".* FROM "dear_mes" WHERE "dear_mes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_dear_me
      @dear_me = DearMe.find(params[:id])