app/controllers/nothings_controller.rb

  def index
    @nothings = Nothing.all
---
SELECT "nothings".* FROM "nothings"

  def create
    @nothing = Nothing.new(nothing_params)

    respond_to do |format|
      if @nothing.save
---
INSERT INTO "nothings" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Coucou"], ["created_at", "2021-05-05 19:03:12.184015"], ["updated_at", "2021-05-05 19:03:12.184015"]]

  def destroy
    @nothing.destroy
---
DELETE FROM "nothings" WHERE "nothings"."id" = $1  [["id", 1]]

    def set_nothing
      @nothing = Nothing.find(params[:id])
---
SELECT "nothings".* FROM "nothings" WHERE "nothings"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]